JonasVannieuwenhuijsen/IoT_Reymen_VanCaekenberghe_Vannieuwenhuijsen/PSOC_Code/BeerPong/source/configs/mqtt_client_config.h
/******************************************************************************
* File Name:   mqtt_client_config.h
*
* Description: This file contains all the configuration macros used by the
*              MQTT client in this example.
*
* Related Document: See README.md
*
*
*******************************************************************************
* Copyright 2020-2021, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation.  All rights reserved.
*
* This software, including source code, documentation and related
* materials ("Software") is owned by Cypress Semiconductor Corporation
* or one of its affiliates ("Cypress") and is protected by and subject to
* worldwide patent protection (United States and foreign),
* United States copyright laws and international treaty provisions.
* Therefore, you may use this Software only as provided in the license
* agreement accompanying the software package from which you
* obtained this Software ("EULA").
* If no EULA applies, Cypress hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software
* source code solely for use in connection with Cypress's
* integrated circuit products.  Any reproduction, modification, translation,
* compilation, or representation of this Software except as specified
* above is prohibited without the express written permission of Cypress.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Cypress
* reserves the right to make changes to the Software without notice. Cypress
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Cypress does
* not authorize its products for use in any products where a malfunction or
* failure of the Cypress product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Cypress's product in a High Risk Product, the manufacturer
* of such system or application assumes all risk of such use and in doing
* so agrees to indemnify Cypress against all liability.
*******************************************************************************/

#ifndef MQTT_CLIENT_CONFIG_H_
#define MQTT_CLIENT_CONFIG_H_

#include "cy_mqtt_api.h"

/*******************************************************************************
* Macros
********************************************************************************/

/***************** MQTT CLIENT CONNECTION CONFIGURATION MACROS *****************/
/* MQTT Broker/Server address and port used for the MQTT connection. */
#define MQTT_BROKER_ADDRESS               "8e7cb7e79ef04fd996c2fc920e3472bd.s1.eu.hivemq.cloud"
#define MQTT_PORT                         8883

/* Set this macro to 1 if a secure (TLS) connection to the MQTT Broker is  
 * required to be established, else 0.
 */
#define MQTT_SECURE_CONNECTION            ( 1 )

/* Configure the user credentials to be sent as part of MQTT CONNECT packet */
#define MQTT_USERNAME                     "BeerPong"
#define MQTT_PASSWORD                     "BeerPong123"


/********************* MQTT MESSAGE CONFIGURATION MACROS **********************/
/* The MQTT topics to be used by the publisher and subscriber. */
#define MQTT_PUB_TOPIC                    "sensorValP1"
#define MQTT_SUB_TOPIC                    "ledValP1"

/* Set the QoS that is associated with the MQTT publish, and subscribe messages.
 * Valid choices are 0, 1, and 2. Other values should not be used in this macro.
 */
#define MQTT_MESSAGES_QOS                 ( 1 )

/* Configuration for the 'Last Will and Testament (LWT)'. It is an MQTT message 
 * that will be published by the MQTT broker if the MQTT connection is 
 * unexpectedly closed. This configuration is sent to the MQTT broker during 
 * MQTT connect operation and the MQTT broker will publish the Will message on 
 * the Will topic when it recognizes an unexpected disconnection from the client.
 * 
 * If you want to use the last will message, set this macro to 1 and configure
 * the topic and will message, else 0.
 */
#define ENABLE_LWT_MESSAGE                ( 0 )
#if ENABLE_LWT_MESSAGE
    #define MQTT_WILL_TOPIC_NAME          MQTT_PUB_TOPIC "/will"
    #define MQTT_WILL_MESSAGE             ("MQTT client unexpectedly disconnected!")
#endif

/* MQTT messages which are published on the MQTT_PUB_TOPIC that controls the
 * device (user LED in this example) state in this code example.
 */
#define MQTT_DEVICE_ON_MESSAGE            "TURN ON"
#define MQTT_DEVICE_OFF_MESSAGE           "TURN OFF"


/******************* OTHER MQTT CLIENT CONFIGURATION MACROS *******************/
/* A unique client identifier to be used for every MQTT connection. */
#define MQTT_CLIENT_IDENTIFIER            "psoc6-mqtt-client"

/* The timeout in milliseconds for MQTT operations in this example. */
#define MQTT_TIMEOUT_MS                   ( 5000 )

/* The keep-alive interval in seconds used for MQTT ping request. */
#define MQTT_KEEP_ALIVE_SECONDS           ( 60 )

/* Every active MQTT connection must have a unique client identifier. If you 
 * are using the above 'MQTT_CLIENT_IDENTIFIER' as client ID for multiple MQTT 
 * connections simultaneously, set this macro to 1. The device will then
 * generate a unique client identifier by appending a timestamp to the 
 * 'MQTT_CLIENT_IDENTIFIER' string. Example: 'psoc6-mqtt-client5927'
 */
#define GENERATE_UNIQUE_CLIENT_ID         ( 1 )

/* The longest client identifier that an MQTT server must accept (as defined
 * by the MQTT 3.1.1 spec) is 23 characters. However some MQTT brokers support 
 * longer client IDs. Configure this macro as per the MQTT broker specification. 
 */
#define MQTT_CLIENT_IDENTIFIER_MAX_LEN    ( 23 )

/* As per Internet Assigned Numbers Authority (IANA) the port numbers assigned 
 * for MQTT protocol are 1883 for non-secure connections and 8883 for secure
 * connections. In some cases there is a need to use other ports for MQTT like
 * port 443 (which is reserved for HTTPS). Application Layer Protocol 
 * Negotiation (ALPN) is an extension to TLS that allows many protocols to be 
 * used over a secure connection. The ALPN ProtocolNameList specifies the 
 * protocols that the client would like to use to communicate over TLS.
 * 
 * This macro specifies the ALPN Protocol Name to be used that is supported
 * by the MQTT broker in use.
 * Note: For AWS IoT, currently "x-amzn-mqtt-ca" is the only supported ALPN 
 *       ProtocolName and it is only supported on port 443.
 * 
 * Uncomment the below line and specify the ALPN Protocol Name to use this 
 * feature.
 */
// #define MQTT_ALPN_PROTOCOL_NAME           "x-amzn-mqtt-ca"

/* Server Name Indication (SNI) is extension to the Transport Layer Security 
 * (TLS) protocol. As required by some MQTT Brokers, SNI typically includes the 
 * hostname in the Client Hello message sent during TLS handshake.
 * 
 * Uncomment the below line and specify the SNI Host Name to use this extension
 * as specified by the MQTT Broker.
 */
#define MQTT_SNI_HOSTNAME                 "8e7cb7e79ef04fd996c2fc920e3472bd.s1.eu.hivemq.cloud"

/* A Network buffer is allocated for sending and receiving MQTT packets over 
 * the network. Specify the size of this buffer using this macro.
 * 
 * Note: The minimum buffer size is defined by 'CY_MQTT_MIN_NETWORK_BUFFER_SIZE' 
 * macro in the MQTT library. Please ensure this macro value is larger than 
 * 'CY_MQTT_MIN_NETWORK_BUFFER_SIZE'.
 */
#define MQTT_NETWORK_BUFFER_SIZE          ( 2 * CY_MQTT_MIN_NETWORK_BUFFER_SIZE )

/* Maximum MQTT connection re-connection limit. */
#define MAX_MQTT_CONN_RETRIES            (150u)

/* MQTT re-connection time interval in milliseconds. */
#define MQTT_CONN_RETRY_INTERVAL_MS      (2000)


/**************** MQTT CLIENT CERTIFICATE CONFIGURATION MACROS ****************/

/* Configure the below credentials in case of a secure MQTT connection. */
/* PEM-encoded client certificate */
#define CLIENT_CERTIFICATE      \
"-----BEGIN CERTIFICATE-----\n" \
"MIIDDzCCAfcCFHtTufmCEZqyfu9GQKTjeHelaLeAMA0GCSqGSIb3DQEBCwUAMEQx\n" \
"CzAJBgNVBAYTAkJFMRAwDgYDVQQIDAdMaW1idXJnMRAwDgYDVQQHDAdIYXNzZWx0\n" \
"MREwDwYDVQQKDAhVSGFzc2VsdDAeFw0yMTExMTExNTUzMjdaFw0yMjExMTExNTUz\n" \
"MjdaMEQxCzAJBgNVBAYTAkJFMRAwDgYDVQQIDAdMaW1idXJnMRAwDgYDVQQHDAdI\n" \
"YXNzZWx0MREwDwYDVQQKDAhVSGFzc2VsdDCCASIwDQYJKoZIhvcNAQEBBQADggEP\n" \
"ADCCAQoCggEBAKrGfV12XUhxMIEaULcTdA6hkVPf3ZDP7TpaJMNVjY4V25qAc3EK\n" \
"V+DrMDgZK9TO1TabaVrrh3gI+ZYAEQJaLbqnqQjMy1HfwA/kRqXY8imMNFwv3map\n" \
"eKt/7sAnvi69k4YizT4st56SI/kEYampyIey00Y6uIy/CneVa57WDsQPT6omdcvM\n" \
"RapOdpc9rPh9QBkgwZ92Iy7aSuE4+ZQIp/L6ExvAEIpgISdKCxte2END4j0gfkkF\n" \
"JNcw0gw+4kloEA1EFR3b14khTE69S4GY5ztATX3//rQeeILtrjoC9JAYl1pQxEMf\n" \
"e9/DZWh8zr5sWib5Ano1hPmC0SBZkjjVAScCAwEAATANBgkqhkiG9w0BAQsFAAOC\n" \
"AQEA4KvP1+vj9goqVA5PgPqP8QGe6oCtnWevEtBe7yTN3JkayW3FJW67+FJEiyOs\n" \
"ucNl0ZDZYdA2iky/1azKN90dy2aQF+QgPiFBHFNk9EGKawTTzap/aDlR+4kK66QM\n" \
"hH0BI4KSG/7h3TKdHceKO7IFIakDsHUQ0youM7uQ/pdYktYBSOvpU7ICkA4Dr1IO\n" \
"Xn+swjuV/hBax/4eJuxVXmBSQxcZsIpBYKbVwtPnxB8XQrXKXLuw2b1Np5B9mVH6\n" \
"n52vQuclB52mXLl2UyH0PMirzHWKp6IxqKal8zeHTyp9rpfR39U9yBdbBlpK8RAn\n" \
"tp4SWM4N2jrpezQVoEMtnc3JXg==\n" \
"-----END CERTIFICATE-----"

/* PEM-encoded client private key */
#define CLIENT_PRIVATE_KEY          \
"-----BEGIN RSA PRIVATE KEY-----\n" \
"MIIEowIBAAKCAQEAqsZ9XXZdSHEwgRpQtxN0DqGRU9/dkM/tOlokw1WNjhXbmoBz\n" \
"cQpX4OswOBkr1M7VNptpWuuHeAj5lgARAlotuqepCMzLUd/AD+RGpdjyKYw0XC/e\n" \
"Zql4q3/uwCe+Lr2ThiLNPiy3npIj+QRhqanIh7LTRjq4jL8Kd5VrntYOxA9PqiZ1\n" \
"y8xFqk52lz2s+H1AGSDBn3YjLtpK4Tj5lAin8voTG8AQimAhJ0oLG17YQ0PiPSB+\n" \
"SQUk1zDSDD7iSWgQDUQVHdvXiSFMTr1LgZjnO0BNff/+tB54gu2uOgL0kBiXWlDE\n" \
"Qx9738NlaHzOvmxaJvkCejWE+YLRIFmSONUBJwIDAQABAoIBABCDSuH7rP9xOnBx\n" \
"W/an4eP8SXIjxmfXQygOSVm97wcbI/Xnj8IRbvfnpez2uh9EtKcoFeLdvWak74VK\n" \
"klp4380ZoyWfr9VF3mtq9k3ZEWllDjcPxeCFaI6kuzBHZ4Nbf2VL/i6R4ltp5CKT\n" \
"AuKF8Ub1yqoSyX+KhXeUsihUqG7ap7GzlI86m5X5XG8chP9/h129VCwJN48t6iK6\n" \
"QrM44QEkjx64rrRhuotv9u6Wj9Fs3Xy6s9qpCzEiVTyz0Kx2TuFdW7fCz9uG9+5z\n" \
"v5WWL5bGJQOnbl+o+wj0fxrLkHXCv9cfB3RgojaLktCkPgwXl1I1Iu+zmXpjP4fq\n" \
"6oIMW+kCgYEA2Pf8mHFVjHsQzsYOvETc+gHX0GuqBG/0S+cRcMXUpAzG//N1y/tY\n" \
"VnU/R2BQTu01ELLOPqX2cMABHP0QrDTumWknc7sFlm/H1xj6M2BH0Uo/DQSKPmqH\n" \
"bURDOlYBhnDjWo+dzTa04VcZvYYrDmHEWO+S4SRcDwk8PVs0bsI7eYUCgYEAyX8r\n" \
"rAkYmrOBQ8X+vczFxK+3t1aQY2fc2njdq5GAo/Qx2i9yz1J08wFxex0fU1Mz04lD\n" \
"ZiliQHccDxqxFaEjznqSyk3ZYVzxF5d04gYtxWPdwDhSKN+SfcZXEcsX9jVguLJY\n" \
"NWf0NvJFVXbRn2JJQWqazY6gfiPLNL+DAWjUWbsCgYEA1yJ1xVZDZGs2jEDYpZeG\n" \
"oSMoshG/YGz+CDETGwYeRZghzfLC78LGodvaJdT7bHdKMceKN5ZqWPwZXnwThx1p\n" \
"JJaetuNPtA4cUk0C8eRa8cwz3p2M0jzhEdgo7PQQyRSwasCS0MOY8QNjk4gwsy7/\n" \
"+Mt8kV9zJLmckJ4ZzGUtgd0CgYB8D6e0+bjDb2hUcTDCbbUKv+IOqOanvcg2X5qk\n" \
"Syb4S57yJqq6yZsmD6puUeT6qczMHsR3v102Md/90MJdfeSM+d0tYDdKgi4TB3a4\n" \
"v3MpCK787fBwKA+LDzaGxxQOzJirv2seHs43kn1r/IdeaeaOt3NuwrVAVQuFg7DG\n" \
"imPMhwKBgGbzIEfzJNdmrmAoye4SAWtfUIMZ7Rgxkx7MtFw5i1JUvu8ryiyikIha\n" \
"K9GwkiDnjozdmYC4GAWeg2mpcUUmDtv9SAIDYNU6VgQSTFRVBioJ23Ga6k2b0bzT\n" \
"m/6EtsNjkvgzrez3g/gZa8nYRQuGnFraI6ocMRZ+FmGsDonR0DqZ\n" \
"-----END RSA PRIVATE KEY-----"

/* PEM-encoded Root CA certificate */
#define ROOT_CA_CERTIFICATE     \
"-----BEGIN CERTIFICATE-----\n" \
"MIIFazCCA1OgAwIBAgIRAIIQz7DSQONZRGPgu2OCiwAwDQYJKoZIhvcNAQELBQAw\n" \
"TzELMAkGA1UEBhMCVVMxKTAnBgNVBAoTIEludGVybmV0IFNlY3VyaXR5IFJlc2Vh\n" \
"cmNoIEdyb3VwMRUwEwYDVQQDEwxJU1JHIFJvb3QgWDEwHhcNMTUwNjA0MTEwNDM4\n" \
"WhcNMzUwNjA0MTEwNDM4WjBPMQswCQYDVQQGEwJVUzEpMCcGA1UEChMgSW50ZXJu\n" \
"ZXQgU2VjdXJpdHkgUmVzZWFyY2ggR3JvdXAxFTATBgNVBAMTDElTUkcgUm9vdCBY\n" \
"MTCCAiIwDQYJKoZIhvcNAQEBBQADggIPADCCAgoCggIBAK3oJHP0FDfzm54rVygc\n" \
"h77ct984kIxuPOZXoHj3dcKi/vVqbvYATyjb3miGbESTtrFj/RQSa78f0uoxmyF+\n" \
"0TM8ukj13Xnfs7j/EvEhmkvBioZxaUpmZmyPfjxwv60pIgbz5MDmgK7iS4+3mX6U\n" \
"A5/TR5d8mUgjU+g4rk8Kb4Mu0UlXjIB0ttov0DiNewNwIRt18jA8+o+u3dpjq+sW\n" \
"T8KOEUt+zwvo/7V3LvSye0rgTBIlDHCNAymg4VMk7BPZ7hm/ELNKjD+Jo2FR3qyH\n" \
"B5T0Y3HsLuJvW5iB4YlcNHlsdu87kGJ55tukmi8mxdAQ4Q7e2RCOFvu396j3x+UC\n" \
"B5iPNgiV5+I3lg02dZ77DnKxHZu8A/lJBdiB3QW0KtZB6awBdpUKD9jf1b0SHzUv\n" \
"KBds0pjBqAlkd25HN7rOrFleaJ1/ctaJxQZBKT5ZPt0m9STJEadao0xAH0ahmbWn\n" \
"OlFuhjuefXKnEgV4We0+UXgVCwOPjdAvBbI+e0ocS3MFEvzG6uBQE3xDk3SzynTn\n" \
"jh8BCNAw1FtxNrQHusEwMFxIt4I7mKZ9YIqioymCzLq9gwQbooMDQaHWBfEbwrbw\n" \
"qHyGO0aoSCqI3Haadr8faqU9GY/rOPNk3sgrDQoo//fb4hVC1CLQJ13hef4Y53CI\n" \
"rU7m2Ys6xt0nUW7/vGT1M0NPAgMBAAGjQjBAMA4GA1UdDwEB/wQEAwIBBjAPBgNV\n" \
"HRMBAf8EBTADAQH/MB0GA1UdDgQWBBR5tFnme7bl5AFzgAiIyBpY9umbbjANBgkq\n" \
"hkiG9w0BAQsFAAOCAgEAVR9YqbyyqFDQDLHYGmkgJykIrGF1XIpu+ILlaS/V9lZL\n" \
"ubhzEFnTIZd+50xx+7LSYK05qAvqFyFWhfFQDlnrzuBZ6brJFe+GnY+EgPbk6ZGQ\n" \
"3BebYhtF8GaV0nxvwuo77x/Py9auJ/GpsMiu/X1+mvoiBOv/2X/qkSsisRcOj/KK\n" \
"NFtY2PwByVS5uCbMiogziUwthDyC3+6WVwW6LLv3xLfHTjuCvjHIInNzktHCgKQ5\n" \
"ORAzI4JMPJ+GslWYHb4phowim57iaztXOoJwTdwJx4nLCgdNbOhdjsnvzqvHu7Ur\n" \
"TkXWStAmzOVyyghqpZXjFaH3pO3JLF+l+/+sKAIuvtd7u+Nxe5AW0wdeRlN8NwdC\n" \
"jNPElpzVmbUq4JUagEiuTDkHzsxHpFKVK7q4+63SM1N95R1NbdWhscdCb+ZAJzVc\n" \
"oyi3B43njTOQ5yOf+1CceWxG1bQVs5ZufpsMljq4Ui0/1lvh+wjChP4kqKOJ2qxq\n" \
"4RgqsahDYVvTH9w7jXbyLeiNdd8XM2w9U/t7y0Ff/9yi0GE44Za4rF2LN9d11TPA\n" \
"mRGunUHBcnWEvgJBQl9nJEiU0Zsnvgc/ubhPgXRR4Xq37Z0j4r7g1SgEEzwxA57d\n" \
"emyPxgcYxn/eR44/KJ4EBs+lVDR3veyJm+kXQ99b21/+jh5Xos1AnX5iItreGCc=\n" \
"-----END CERTIFICATE-----"


/******************************************************************************
* Global Variables
*******************************************************************************/
extern cy_mqtt_broker_info_t broker_info;
extern cy_awsport_ssl_credentials_t  *security_info;
extern cy_mqtt_connect_info_t connection_info;


#endif /* MQTT_CLIENT_CONFIG_H_ */
